
VERIFICATION_KEY_WORDS_CN = [
    "验证码",
    "校验码",
    "检验码",
    "确认码",
    "激活码",
    "动态码",

    "验证代码",
    "校验代码",
    "检验代码",
    "激活代码",
    "确认代码",
    "动态代码",

    "短信口令",
    "动态密码",
    "交易码",
    "上网密码",

    "驗證碼",
    "校驗碼",
    "檢驗碼",
    "確認碼",
    "激活碼",
    "動態碼",

    "驗證代碼",
    "校驗代碼",
    "檢驗代碼",
    "確認代碼",
    "激活代碼",
    "動態代碼",
]

VERIFICATION_KEYWORDS_REGEX = "验证码|校验码|检验码|确认码|激活码|动态码" + \
                              "|验证代码|校验代码|检验代码|激活代码|确认代码|动态代码" + \
                              "|登入码|认证码|识别码" + \
                              "|短信口令|动态密码|交易码|上网密码|随机码|动态口令" + \
                              "|驗證碼|校驗碼|檢驗碼|確認碼|激活碼|動態碼" + \
                              "|驗證代碼|校驗代碼|檢驗代碼|確認代碼|激活代碼|動態代碼" + \
                              "|登入碼|認證碼|識別碼" + \
                              "|Code|code|CODE"

VERIFICATION_KEY_WORDS_EN = [
    "Code",
    "code",
    "CODE",
]

PHONE_NUMBER_KEYWORDS = "手机号|电话号" + \
                        "|手機號|電話號" + \
                        "|(?i)phone(?-i)" + \
                        "|(?i)number(?-i)"

FILTER_REGEX = "退订|丹梦"

BLOCK_PHONE_NUMBER_LISTS = ['106980095558']

LEVEL_NONE = -1
LEVEL_CHARACTER = 0  # 匹配度：纯字母, 匹配度最低
LEVEL_TEXT = 1  # 匹配度：数字+字母 混合, 匹配度其次
LEVEL_DIGITAL_OTHERS = 2  # 匹配度：纯数字, 匹配度最高
LEVEL_DIGITAL_4 = 3  # 匹配度：4位纯数字，匹配度次之
LEVEL_DIGITAL_6 = 4  # 匹配度：6位纯数字，匹配度最高
